In [12]:
import pandas as pd
# import psycopg2 as psy
import sqlalchemy # Thư viện dành cho hiển thị sql trong file

# Import thư viện kết nối với postgresql
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:98919891@153.92.214.210:5432/er_sample')


# load
%load_ext pycodestyle_magic

# Bắt đầu cho phép sử dụng sql trong dòng lệnh
%reload_ext sql

# Khởi tạo kết nối với server database
%sql postgresql://postgres:98919891@153.92.214.210:5432/er_sample

The pycodestyle_magic extension is already loaded. To reload it, use:
  %reload_ext pycodestyle_magic

<h1>CHAPTER 16</h1>

1 血液型が O 型の会員一覧を表示しなさい。業種、職種が設定されていない会員についても表示する必要がある。
結果表は「姓」、「名」、「業種名」、「職種名」を見出しとして表示しなさい。

In [15]:
%%sql
SELECT
    m.first_name AS "姓"
    ,m.last_name AS "名"
    ,bt.business_type_name AS "業種名"
    ,jt.job_type_name AS "職種名"
FROM 
    member as m
    left join business_type as bt
        on m.business_type_id = bt.business_type_id
    left join job_type as jt
        on m.job_type_id = jt.job_type_id
WHERE 
    m.blood_type = 'O'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
4 rows affected.

[('美和子', '平井', '会計・税理', '総務・人事'),
 ('裕子', '田中', '電気機器関連', '技術'),
 ('武', '斉藤', None, None),
 ('栄次', '野口', '製造業', '生産・製造')]

2 東京都在住の会員が所持するクレジットカード情報の一覧を表示しなさい。結果表は「氏名」、「カード番号」、「有
効期限(YY/MM)」、「クレジットカード会社名」を見出しとして表示しなさい。

In [40]:
%%sql
SELECT
    m.first_name || m.last_name AS "氏名"
    ,mc.card_number AS "カード番号"
    ,mc.expire_year || '/' || mc.expire_month AS "有効期限(YY/MM)"
    ,cc.card_company_name AS "クレジットカード会社名"
    ,m.address
FROM
    member_card AS mc
    LEFT OUTER JOIN member AS m
        ON mc.member_id = m.member_id
    LEFT OUTER JOIN card_company AS cc
        ON mc.card_company_id = cc.card_company_id
WHERE 
    m.address LIKE '東京都%'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
4 rows affected.

[('勝佐藤', '3333-3333-3333-3333', '11/04', 'ビゼ', '東京都東村山市栄町9-22-2-101'),
 ('明仁内藤', '6666-6666-6666-6666', '15/08', 'ビゼ', '東京都八王子市上野町2-8-91'),
 ('明仁内藤', '6666-6666-6666-6667', '13/10', 'アメリカンエックス', '東京都八王子市上野町2-8-91'),
 ('勝佐藤', '7777-0000-3333-2222', '12/02', 'アメリカンエックス', '東京都東村山市栄町9-22-2-101')]

3 2011 年 4 月 1 日以降の注文を全て会員 ID、注文番号順に一覧表示する。結果表は「注文番号」、「氏名」、「有
効期限(YY/MM)」、「クレジットカード会社名」を見出しとして表示しなさい。ただし、有効期限(YY/MM)とクレジット
カード会社名はクレジットカード決済された注文についてのみ表示すればよい。

In [42]:
%%sql
SELECT 
    oh.order_no AS "注文番号"
    ,m.first_name || m.last_name AS "氏名"
    ,mc.expire_year || '/' || mc.expire_month AS "有効期限(YY/MM)"
    ,cc.card_company_name AS "クレジットカード会社名"
FROM
    order_header AS oh
    LEFT JOIN member AS m
        ON oh.member_id = m.member_id
    INNER JOIN member_card AS mc
        ON oh.member_id = mc.member_id
            AND oh.member_card_id = mc.member_card_id
    LEFT JOIN card_company AS cc
        ON mc.card_company_id = cc.card_company_id
WHERE 
    oh.order_datetime > '2011-04-01'    
ORDER BY
    m.member_id ASC
    ,oh.order_no ASC
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
9 rows affected.

[('OD000014', '太郎山田', '15/01', 'セゾナ'),
 ('OD000016', '明仁内藤', '15/08', 'ビゼ'),
 ('OD000024', '明仁内藤', '15/08', 'ビゼ'),
 ('OD000010', '美和子平井', '16/11', 'ラクトン'),
 ('OD000020', '美和子平井', '14/08', 'アメリカンエックス'),
 ('OD000015', '圭子佐藤', '14/04', 'ビゼ'),
 ('OD000023', '圭子佐藤', '12/09', 'アメリカンエックス'),
 ('OD000018', '一郎森山', '12/07', 'セゾナ'),
 ('OD000012', '栄次野口', '13/04', 'セゾナ')]

4 2011 年より前の注文の内訳を一覧表示しなさい。結果表は「注文番号」、「注文日時」、「注文者の氏名」、「書籍
名」を見出しとして表示しなさい。並び順は注文番号、注文明細番号とする。

In [45]:
%%sql
SELECT 
    od.order_no AS "注文番号"
    ,oh.order_datetime AS "注文日時"
    ,m.first_name || '/' || m.last_name AS "注文者の氏名"
    ,b.book_name AS "書籍名"
FROM
    order_detail AS od
    LEFT JOIN order_header AS oh
        ON od.order_no = oh.order_no
    LEFT JOIN member AS m
        ON oh.member_id = m.member_id
    LEFT JOIN book AS b
        ON od.item_id = b.book_id       
WHERE 
    EXTRACT(YEAR FROM oh.order_datetime) < '2011'    
ORDER BY
    od.order_no ASC
    ,od.order_detail_no ASC
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
9 rows affected.

[('OD000001', datetime.datetime(2010, 1, 6, 7, 24, 32), '有香/南', 'Effective Ruby 第2版'),
 ('OD000001', datetime.datetime(2010, 1, 6, 7, 24, 32), '有香/南', 'UNIXネットワークプログラム'),
 ('OD000002', datetime.datetime(2010, 5, 9, 18, 24, 58), '栄次/野口', '達人開発者'),
 ('OD000003', datetime.datetime(2010, 6, 11, 11, 22, 32), '裕子/田中', '真珠のプログラミング'),
 ('OD000004', datetime.datetime(2010, 6, 18, 12, 21, 12), '太郎/山田', 'UNIXネットワークプログラム'),
 ('OD000005', datetime.datetime(2010, 9, 9, 17, 52, 23), '圭子/佐藤', '80歳を超えても30代に見える生き方'),
 ('OD000006', datetime.datetime(2010, 9, 21, 8, 32), '明仁/内藤', '永遠の1'),
 ('OD000007', datetime.datetime(2010, 11, 20, 23, 49, 12), '武/斉藤', '生物と生物のあいだ'),
 ('OD000008', datetime.datetime(2010, 12, 31, 19, 45, 42), '一郎/森山', '世紀末の隣人')]

5 血液型が O 型の会員の注文について、決済に利用されたカード会社毎の注文回数を求めなさい。結果表は「カー
ド会社 ID」、「決済利用回数」を見出しとして表示しなさい。ただし、クレジットカード決済以外の回数についても一
覧に含めることとし、カード会社 ID には「OTHER」と表示すること。

In [71]:
%%sql
SELECT
    (CASE 
        WHEN mc.card_company_id <> 'None' THEN mc.card_company_id
        ELSE 'OTHER'
     END)AS "カード会社ID"
    ,COUNT(*) AS "決済利用回数"
FROM 
    order_header AS oh
    LEFT JOIN member AS m
        ON oh.member_id = m.member_id
    LEFT JOIN member_card AS mc
        ON oh.member_id = mc.member_id AND oh.member_card_id = mc.member_card_id
WHERE 
    m.blood_type = 'O'
GROUP BY
    mc.card_company_id
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
4 rows affected.

[('AMEX', 1), ('RKTN', 2), ('SASN', 1), ('OTHER', 5)]

6 会員毎の 2010 年 12 月 31 日以前の購入金額合計を求めなさい。ただし、書籍1冊分の購入金額は「書籍の価
格-値引き金額」で求めることとする。結果表は「会員 ID」、「購入金額合計」を見出しとして表示しなさい。

In [72]:
%%sql
SELECT
    oh.member_id AS "会員 ID"
    ,SUM(b.price - b.discount) AS "購入金額合計"
FROM
    order_detail AS od
    LEFT JOIN book b
        ON od.item_id = b.book_id
    LEFT JOIN order_header AS oh
        ON od.order_no = oh.order_no
WHERE 
    order_datetime <= '2010-12-31'
GROUP BY 
    oh.member_id
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
7 rows affected.

[('M004', 700),
 ('M006', 830),
 ('M001', 7200),
 ('M010', 840),
 ('M002', 3450),
 ('M009', 10880),
 ('M012', 3600)]

7 「講番社」が出版しているカテゴリがノンフィクション以外の書籍を全て一覧表示しなさい。結果表は「書籍 ID」、「書
籍名」、「カテゴリ名」を見出しとして表示しなさい。

In [77]:
%%sql
SELECT
    b.book_id AS "書籍ID"
    ,b.book_name AS "書籍名"
    ,c.category_name AS "カテゴリ名"
FROM
    book AS b
    LEFT JOIN category AS c
        ON b.category_id = c.category_id
    LEFT JOIN publisher AS p
        ON b.publisher_id = p.publisher_id
WHERE
    c.category_name <> 'ノンフィクション'
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
38 rows affected.

[('B0000001', '達人開発者', 'コンピューター'),
 ('B0000002', 'Effective Ruby 第2版', 'コンピューター'),
 ('B0000003', '真珠のプログラミング', 'コンピューター'),
 ('B0000004', '満月の神話 新装版', 'コンピューター'),
 ('B0000005', 'UNIXネットワークプログラム', 'コンピューター'),
 ('B0000007', '永遠の1', '新書・文庫'),
 ('B0000008', '生物と生物のあいだ', '新書・文庫'),
 ('B0000011', '愉快な現実', '政治'),
 ('B0000013', '沖縄の密約', '政治'),
 ('B0000006', '80歳を超えても30代に見える生き方', '新書・文庫'),
 ('B0000012', '西日本中枢の崩壊', '政治'),
 ('B0000023', '昨日の晩ごはん', '新書・文庫'),
 ('B0000025', 'これからの世界', '政治'),
 ('B0000026', 'グローバルのススメ', 'ビジネス'),
 ('B0000027', '日本の夜明け', '政治'),
 ('B0000028', '頑張ればJava', 'コンピューター'),
 ('B0000029', '明けの明星', '新書・文庫'),
 ('B0000031', 'いつだってUML', 'コンピューター'),
 ('B0000033', '楽しいプログラミング', 'コンピューター'),
 ('B0000034', 'メビウスの輪を超えて', 'ビジネス'),
 ('B0000035', '深海のシーラカンス', '新書・文庫'),
 ('B0000036', '裏金', '政治'),
 ('B0000037', 'かしこい消費税', 'ビジネス'),
 ('B0000038', '恋のサブリミナル', '新書・文庫'),
 ('B0000039', '亭主関白と政治', 'ビジネス'),
 ('B0000041', '雨雲', '新書・文庫'),
 ('B0000042', '週末のオブジェクト指向クラブ', 'コンピューター'),
 ('B0000043', 'ダークサイドジャパン', '政治'),
 ('B0000045', 'ドブ臭くたって', 'ビジネス'),
 ('B0000046', '永遠の向こう側', '新書・文庫'),
 ('B0000047', 'みんなでクラウド', 'コンピューター'),
 ('B0000048', '献金！献金！また献金！', '政治'),
 ('B0000050', '親父からのビジネス', 'ビジネス'),
 ('B0000051', '思い出のHTML', 'コンピューター'),
 ('B0000053', 'ららら', '新書・文庫'),
 ('B0000054', '誰よりもおいしく', '政治'),
 ('B0000055', '100年後', '政治'),
 ('B0000056', '湯けむりの嗜み', '新書・文庫')]

8 値引き前の価格が 1000 円以上の書籍を購入したことがある会員の会員 ID、氏名、職種名の一覧を、結果表の
見出しが「会員 ID」、「氏名」、「職種名」となるように表示しなさい。表示順は会員 ID 順で表示しなさい。

In [88]:
%%sql 
SELECT
    oh.member_id AS "会員ID"
    ,m.first_name || m.last_name AS "氏名"
    ,jt.job_type_name AS "職種名"
FROM
    -- Do phải được đặt hàng rồi mới tính -> chọn od / oh
    -- car lv của od > oh chọn od
    order_detail AS od
    
    -- Đã được đặt hàng, và giá trị book_id tại od và b là notnull -> dùng inner 
    INNER JOIN book AS b
        ON od.item_id = b.book_id
        
    -- Đã được đặt hàng, và giá trị order_no tại od và oh là notnull -> dùng inner
    INNER JOIN order_header AS oh
        ON od.order_no = oh.order_no
        
    -- member_id tại m và oh cũng là not null -> inner
    INNER JOIN member AS m
        ON oh.member_id = m.member_id
    
    -- giá trị của m và jt tại job_type_id có thể null -> left
    LEFT JOIN job_type AS jt
        ON m.job_type_id = jt.job_type_id
WHERE 
    b.price >= 1000
ORDER BY
    oh.member_id
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
17 rows affected.

[('M001', '太郎山田', '管理'),
 ('M001', '太郎山田', '管理'),
 ('M002', '裕子田中', '技術'),
 ('M004', '武斉藤', None),
 ('M004', '武斉藤', None),
 ('M004', '武斉藤', None),
 ('M006', '明仁内藤', '広報・宣伝'),
 ('M008', '春樹東山', None),
 ('M008', '春樹東山', None),
 ('M009', '有香南', '研究・教員'),
 ('M009', '有香南', '研究・教員'),
 ('M009', '有香南', '研究・教員'),
 ('M010', '圭子佐藤', '管理'),
 ('M011', '一郎森山', '技術'),
 ('M011', '一郎森山', '技術'),
 ('M012', '栄次野口', '生産・製造'),
 ('M012', '栄次野口', '生産・製造')]